app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'rendi'
 LIMIT 1
---
    public function login_action()
    {
        $session = session();
        $model = new UserModel();

        $user = $this->request->getPost('username');
        $pass = $this->request->getPost('password');
        $role = $this->request->getPost('role');

        $dataUser = $model->where('username', $user)->first();