app/Controllers/Dashboard.php

    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }

        $model = new AssetModel();
        $data['semua_aset'] = $model->findAll();
        $data['total_aset'] = $model->countAll();
---
SELECT *
FROM `assets`
SELECT COUNT(*) AS `numrows` FROM `assets`

    public function save()
    {
        $model = new AssetModel();
        $model->save([
            'nama_aset' => $this->request->getPost('nama_aset'),
            'kategori'  => $this->request->getPost('kategori'),
            'status'    => $this->request->getPost('status'),
            'pic'       => $this->request->getPost('pic'),
        ]);
---
INSERT INTO `assets` (`nama_aset`, `kategori`, `status`, `pic`) VALUES ('Aplikasi Monitoring V1', 'Hardware', 'Maintenance', 'Erland')

    public function edit($id)
    {
        if (!session()->get('logged_in')) return redirect()->to('/');

        $model = new AssetModel();
        $data['aset'] = $model->find($id);
---
SELECT *
FROM `assets`
WHERE `assets`.`id` = '4'

    public function delete($id)
    {
        $model = new AssetModel();
        $model->delete($id);
---
DELETE FROM `assets`
WHERE `id` IN ('4')